# Names and ID

## Osama Osman - 201909415

# Project due by `Thursday 9/5/2024`

# Objective:
## 
# Overview:
## 
## 
Dataset Source:
The dataset can be obtained from Kaggle at the following link: [Data Science Salaries 2023 ðŸ’¸
](----)

# Predicting

# **Setup**

In [116]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn.tree import plot_tree
from sklearn.ensemble import RandomForestClassifier
import numpy as np
from sklearn import metrics #Import scikit-learn metrics module for accuracy calculation
from sklearn.metrics import confusion_matrix, ConfusionMatrixDisplay
from sklearn.model_selection import cross_val_score

import matplotlib.pyplot as plt
from sklearn import tree
from sklearn.model_selection import GridSearchCV
from sklearn.datasets import load_iris
from sklearn.tree import DecisionTreeRegressor, plot_tree
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import RobustScaler
from sklearn.preprocessing import Normalizer
from sklearn.preprocessing import QuantileTransformer
import matplotlib.pyplot as plt
from sklearn.metrics import mean_squared_error
from sklearn.metrics import r2_score
from sklearn.ensemble import ExtraTreesClassifier

In [117]:
# **1 - Data Exploration**
# Load the dataset
data = pd.read_csv('used_cars_data.csv')
data

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7248,7248,Volkswagen Vento Diesel Trendline,Hyderabad,2011,89411,Diesel,Manual,First,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN,NaN
7249,7249,Volkswagen Polo GT TSI,Mumbai,2015,59000,Petrol,Automatic,First,17.21 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7250,7250,Nissan Micra Diesel XV,Kolkata,2012,28000,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,NaN
7251,7251,Volkswagen Polo GT TSI,Pune,2013,52262,Petrol,Automatic,Third,17.2 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7252,7252,Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...,Kochi,2014,72443,Diesel,Automatic,First,10.0 kmpl,2148 CC,170 bhp,5.0,NaN,NaN

In [118]:
# Check the shape of the dataset
data.shape

(7253, 14)

In [119]:
# Check for data types
data.dtypes

S.No.                  int64
Name                  object
Location              object
Year                   int64
Kilometers_Driven      int64
Fuel_Type             object
Transmission          object
Owner_Type            object
Mileage               object
Engine                object
Power                 object
Seats                float64
New_Price             object
Price                float64
dtype: object

In [120]:
# Display the information about the data, such as the number of rows and columns, data types, and memory usage.
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7253 entries, 0 to 7252
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   S.No.              7253 non-null   int64
 1   Name               7253 non-null   object
 2   Location           7253 non-null   object
 3   Year               7253 non-null   int64
 4   Kilometers_Driven  7253 non-null   int64
 5   Fuel_Type          7253 non-null   object
 6   Transmission       7253 non-null   object
 7   Owner_Type         7253 non-null   object
 8   Mileage            7251 non-null   object
 9   Engine             7207 non-null   object
 10  Power              7207 non-null   object
 11  Seats              7200 non-null   float64
 12  New_Price          1006 non-null   object
 13  Price              6019 non-null   float64
dtypes: float64(2), int64(3), object(9)
memory usage: 793.4+ KB

In [121]:
# Display summary statistics
data.describe()

             S.No.         Year  Kilometers_Driven        Seats        Price
count  7253.000000  7253.000000       7.253000e+03  7200.000000  6019.000000
mean   3626.000000  2013.365366       5.869906e+04     5.279722     9.479468
std    2093.905084     3.254421       8.442772e+04     0.811660    11.187917
min       0.000000  1996.000000       1.710000e+02     0.000000     0.440000
25%    1813.000000  2011.000000       3.400000e+04     5.000000     3.500000
50%    3626.000000  2014.000000       5.341600e+04     5.000000     5.640000
75%    5439.000000  2016.000000       7.300000e+04     5.000000     9.950000
max    7252.000000  2019.000000       6.500000e+06    10.000000   160.000000

In [122]:
data.describe(include=["O"])

,Name,Location,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,New_Price
count,7253,7253,7253,7253,7253,7251,7207,7207,1006
unique,2041,11,5,2,4,450,150,386,625
top,Mahindra XUV500 W8 2WD,Mumbai,Diesel,Manual,First,17.0 kmpl,1197 CC,74 bhp,63.71 Lakh
freq,55,949,3852,5204,5952,207,732,280,6

### Convert Millage every Km/kg to kmpl

In [123]:

# Define a conversion factor (example: 1 km/kg is approximated as 1.5 kmpl)
conversion_factor = 1.5

# Updated function to convert km/kg to kmpl
def convert_mileage(mileage):
    if isinstance(mileage, str):
        if 'km/kg' in mileage:
            value = float(mileage.split()[0])
            return f"{value * conversion_factor} kmpl"
    return mileage

# Apply the conversion function to the Mileage column
data['Mileage'] = data['Mileage'].apply(convert_mileage)

# Save the modified dataframe to a new CSV file
data.to_csv('updated_cars_data.csv', index=False)

# Optionally print the updated DataFrame to check results
print(data.head())

   S.No.                              Name    Location  Year  \
0      0            Maruti Wagon R LXI CNG      Mumbai  2010
1      1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
2      2                      Honda Jazz V     Chennai  2011
3      3                 Maruti Ertiga VDI     Chennai  2012
4      4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013

   Kilometers_Driven Fuel_Type Transmission Owner_Type  \
0              72000       CNG       Manual      First
1              41000    Diesel       Manual      First
2              46000    Petrol       Manual      First
3              87000    Diesel       Manual      First
4              40670    Diesel    Automatic     Second

                   Mileage   Engine      Power  Seats  New_Price  Price
0  39.900000000000006 kmpl   998 CC  58.16 bhp    5.0        NaN   1.75
1               19.67 kmpl  1582 CC  126.2 bhp    5.0        NaN  12.50
2                18.2 kmpl  1199 CC   88.7 bhp    5.0  8.61 Lakh   4.50
3               20.77 kmpl  1248 CC  88.76 bhp    7.0        NaN   6.00
4                15.2 kmpl  1968 CC  140.8 bhp    5.0        NaN  17.74

### Removing lakh from New_Price

In [124]:
# Function to remove 'Lakh' from prices
def remove_lakh(text):
    if isinstance(text, str) and 'Lakh' in text:
        # Split the string and return only the numeric part
        numeric_part = text.split()[0]
        return numeric_part
    return text

# Apply the function to the New_Price column
data['New_Price'] = data['New_Price'].apply(remove_lakh)

# Convert the numeric part to float, and handle possible errors or non-numeric data
data['New_Price'] = pd.to_numeric(data['New_Price'], errors='coerce')

# Save the modified dataframe to a new CSV file
data.to_csv('updated_cars_data.csv', index=False)

# Optionally print the updated DataFrame to check results
print(data[['Name', 'New_Price']])

                                                   Name  New_Price
0                                Maruti Wagon R LXI CNG        NaN
1                      Hyundai Creta 1.6 CRDi SX Option        NaN
2                                          Honda Jazz V       8.61
3                                     Maruti Ertiga VDI        NaN
4                       Audi A4 New 2.0 TDI Multitronic        NaN
...                                                 ...        ...
7248                  Volkswagen Vento Diesel Trendline        NaN
7249                             Volkswagen Polo GT TSI        NaN
7250                             Nissan Micra Diesel XV        NaN
7251                             Volkswagen Polo GT TSI        NaN
7252  Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...        NaN

[7253 rows x 2 columns]

### Delete units of measurement

### make a column updated_price that contain the last price

In [125]:
# Approach using numpy.where
data['updated_price'] = np.where(pd.notna(data['New_Price']), data['New_Price'], data['Price'])

# Alternatively, you can use apply method which is more flexible for complex conditions:
# Define a function that will be applied to each row
def choose_price(row):
    if pd.notna(row['New_Price']):
        return row['New_Price']
    else:
        return row['Price']

# Apply the function to each row
data['updated_price'] = data.apply(choose_price, axis=1)

# Save the modified DataFrame to a new CSV file
data.to_csv('updated_cars_data.csv', index=False)

# Optionally print the updated DataFrame to check results
print(data[['Name', 'Price', 'New_Price', 'updated_price']])

                                                   Name  Price  New_Price  \
0                                Maruti Wagon R LXI CNG   1.75        NaN
1                      Hyundai Creta 1.6 CRDi SX Option  12.50        NaN
2                                          Honda Jazz V   4.50       8.61
3                                     Maruti Ertiga VDI   6.00        NaN
4                       Audi A4 New 2.0 TDI Multitronic  17.74        NaN
...                                                 ...    ...        ...
7248                  Volkswagen Vento Diesel Trendline    NaN        NaN
7249                             Volkswagen Polo GT TSI    NaN        NaN
7250                             Nissan Micra Diesel XV    NaN        NaN
7251                             Volkswagen Polo GT TSI    NaN        NaN
7252  Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...    NaN        NaN

      updated_price
0              1.75
1             12.50
2              8.61
3              6.00
4             17.74
...             ...
7248            NaN
7249            NaN
7250            NaN
7251            NaN
7252            NaN

[7253 rows x 4 columns]

convert the last prices from rubees to dollars

In [126]:
# Define the current exchange rate from rupees to dollars (update this value as needed)
rupee_to_dollar = 1 / 83.37  # Example exchange rate, 1 dollar = 83.37 rupees

# Function to convert from lakh rupees to dollars
def lakh_rupees_to_dollars(lakh_rupees):
    if pd.notna(lakh_rupees):
        # Convert from lakh to rupees
        rupees = float(lakh_rupees) * 100000
        # Convert rupees to dollars
        dollars = rupees * rupee_to_dollar
        return round(dollars, 2)  # Round to two decimal places for currency
    return lakh_rupees

# Apply the conversion function to the updated_price column
data['updated_price'] = data['updated_price'].apply(lakh_rupees_to_dollars)

# Save the modified DataFrame to a new CSV file
data.to_csv('updated_cars_data_in_dollars.csv', index=False)

# Optionally print the updated DataFrame to check results
print(data[['Name', 'updated_price']])

                                                   Name  updated_price
0                                Maruti Wagon R LXI CNG        2099.08
1                      Hyundai Creta 1.6 CRDi SX Option       14993.40
2                                          Honda Jazz V       10327.46
3                                     Maruti Ertiga VDI        7196.83
4                       Audi A4 New 2.0 TDI Multitronic       21278.64
...                                                 ...            ...
7248                  Volkswagen Vento Diesel Trendline            NaN
7249                             Volkswagen Polo GT TSI            NaN
7250                             Nissan Micra Diesel XV            NaN
7251                             Volkswagen Polo GT TSI            NaN
7252  Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...            NaN

[7253 rows x 2 columns]

### Remove some measurement units from kmpl from Mileage column , CC from Engine column , bhp from Power column then convert all of them from string to integer

In [131]:
# Function to remove specified unit from a string and convert to float
def remove_units_and_convert(value, unit):
    if pd.notna(value) and isinstance(value, str):
        clean_value = value.replace(unit, '').strip()
        if clean_value.lower() == 'null':  # Check for 'null' after removing unit
            return 0  # Convert 'null' to 0
        return float(clean_value)  # Attempt to convert the cleaned string to float
    return value

# Apply the function to Mileage, Engine, Power columns
data['Mileage'] = data['Mileage'].apply(remove_units_and_convert, args=('kmpl',))
data['Engine'] = data['Engine'].apply(remove_units_and_convert, args=('CC',))
data['Power'] = data['Power'].apply(remove_units_and_convert, args=('bhp',))

# Convert columns to appropriate types
data['Engine'] = data['Engine'].astype(float)
data['Power'] = data['Power'].astype(float)

# Save the modified DataFrame to a new CSV file
data.to_csv('updated_cars_data.csv', index=False)

# Optionally print the updated DataFrame to check results
print(data[['Name', 'Mileage', 'Engine', 'Power']])

                                                   Name  Mileage  Engine  \
0                                Maruti Wagon R LXI CNG    39.90   998.0
1                      Hyundai Creta 1.6 CRDi SX Option    19.67  1582.0
2                                          Honda Jazz V    18.20  1199.0
3                                     Maruti Ertiga VDI    20.77  1248.0
4                       Audi A4 New 2.0 TDI Multitronic    15.20  1968.0
...                                                 ...      ...     ...
7248                  Volkswagen Vento Diesel Trendline    20.54  1598.0
7249                             Volkswagen Polo GT TSI    17.21  1197.0
7250                             Nissan Micra Diesel XV    23.08  1461.0
7251                             Volkswagen Polo GT TSI    17.20  1197.0
7252  Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...    10.00  2148.0

       Power
0      58.16
1     126.20
2      88.70
3      88.76
4     140.80
...      ...
7248  103.60
7249  103.60
7250   63.10
7251  103.60
7252  170.00

[7253 rows x 4 columns]

### convert Engine from cubic centimetres to litres

In [132]:
# Function to remove 'CC' from engine values and convert to float
def clean_engine(engine):
    if pd.notna(engine) and isinstance(engine, str):
        # Remove 'CC' and any extra spaces, then convert to float
        return float(engine.replace('CC', '').strip())
    return engine

# Apply the function to clean the 'Engine' column
data['Engine'] = data['Engine'].apply(clean_engine)

# Convert engine capacity from cc to liters
data['Engine'] = data['Engine'] / 1000

# Optionally rename the column to 'Engine (liters)' for clarity
data.rename(columns={'Engine': 'Engine (liters)'}, inplace=True)

# Save the modified DataFrame to a new CSV file
data.to_csv('updated_cars_data.csv', index=False)

# Optionally print the updated DataFrame to check results
print(data[['Name', 'Engine (liters)']])

                                                   Name  Engine (liters)
0                                Maruti Wagon R LXI CNG            0.998
1                      Hyundai Creta 1.6 CRDi SX Option            1.582
2                                          Honda Jazz V            1.199
3                                     Maruti Ertiga VDI            1.248
4                       Audi A4 New 2.0 TDI Multitronic            1.968
...                                                 ...              ...
7248                  Volkswagen Vento Diesel Trendline            1.598
7249                             Volkswagen Polo GT TSI            1.197
7250                             Nissan Micra Diesel XV            1.461
7251                             Volkswagen Polo GT TSI            1.197
7252  Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...            2.148

[7253 rows x 2 columns]

# Frequency counts for categorical variables

In [ ]:
# Frequency counts for categorical variables
data['Name'].value_counts()

Name
Mahindra XUV500 W8 2WD                  55
Maruti Swift VDI                        49
Maruti Swift Dzire VDI                  42
Honda City 1.5 S MT                     39
Maruti Swift VDI BSIV                   37
                                        ..
Chevrolet Beat LT Option                 1
Skoda Rapid 1.6 MPI AT Elegance Plus     1
Ford EcoSport 1.5 TDCi Ambiente          1
Hyundai i10 Magna 1.1 iTech SE           1
Hyundai Elite i20 Magna Plus             1
Name: count, Length: 2041, dtype: int64

In [ ]:
data['Location'].value_counts()

Location
Mumbai        949
Hyderabad     876
Coimbatore    772
Kochi         772
Pune          765
Delhi         660
Kolkata       654
Chennai       591
Jaipur        499
Bangalore     440
Ahmedabad     275
Name: count, dtype: int64

In [ ]:
data['Fuel_Type'].value_counts()

Fuel_Type
Diesel      3852
Petrol      3325
CNG           62
LPG           12
Electric       2
Name: count, dtype: int64

In [ ]:
data['Transmission'].value_counts()

Transmission
Manual       5204
Automatic    2049
Name: count, dtype: int64

In [ ]:
data['Owner_Type'].value_counts()

Owner_Type
First             5952
Second            1152
Third              137
Fourth & Above      12
Name: count, dtype: int64